app/controllers/current_user_controller.rb

UPDATE "users" SET "updated_at" = $1, "high_score" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-11-04 16:41:38.590649"], ["high_score", "10.0"], ["id", 16]]
---
  def high_score
    user = current_user
    user.update_attribute(:high_score, params[:high_score])

UPDATE "users" SET "updated_at" = $1 WHERE "users"."id" = $2  [["updated_at", "2022-11-04 18:39:37.344013"], ["id", 10]]
---
  def set_avatar
    user = current_user
    user.update_attribute(:avatar, params[:avatar])