app/controllers/users_controller.rb

    def current
        @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]